In [1]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [13]:
# Read the CSV files into DataFrames.
df_2020 = pd.read_csv('athletic_sales_2020.csv')
df_2021 = pd.read_csv('athletic_sales_2021.csv')
print(pd)

<module 'pandas' from '/opt/anaconda3/lib/python3.11/site-packages/pandas/__init__.py'>

In [15]:
# Display the 2020 sales DataFrame
print("Columns in 2020 DataFrame:")
print(df_2020.columns)
print("\nColumns in 2021 DataFrame:")
print(df_2021.columns)

Columns in 2020 DataFrame:
Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

Columns in 2021 DataFrame:
Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [17]:
# Display the 2021 sales DataFrame
print("2021 Sales DataFrame:")
print(df_2021)

2021 Sales DataFrame:
         retailer  retailer_id invoice_date     region         state  \
0       West Gear      1128299       1/1/21       West    California
1       West Gear      1128299       1/1/21       West    California
2          Kohl's      1189833       1/1/21    Midwest       Montana
3          Kohl's      1189833       1/1/21    Midwest       Montana
4       West Gear      1128299       1/1/21       West    California
...           ...          ...          ...        ...           ...
8341  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8342  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
8343       Amazon      1185732     12/31/21  Northeast         Maine
8344       Amazon      1185732     12/31/21  Northeast         Maine
8345  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

               city                  product  price_per_unit  units_sold  \
0     San Francisco  Men's Athletic Footwear              65         750
1     San Francisco  Men's Athletic Footwear              51         233
2          Billings            Men's Apparel              50         275
3          Billings            Men's Apparel              47          77
4     San Francisco  Men's Athletic Footwear              64         225
...             ...                      ...             ...         ...
8341   Philadelphia            Men's Apparel              63          47
8342   Philadelphia            Men's Apparel              46          56
8343       Portland            Men's Apparel              52          36
8344       Portland            Men's Apparel              55         125
8345   Philadelphia            Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          487500         121875.00       Outlet
1           11883           3208.41       Outlet
2          137500          82500.00       Outlet
3            3619           2714.25       Online
4           14400           5184.00       Online
...           ...               ...          ...
8341         2961           1362.06       Online
8342         2576           1004.64       Outlet
8343         1872            692.64       Online
8344        68750          17187.50       Outlet
8345       122500          42875.00       Outlet

[8346 rows x 12 columns]

#### Check the data types of each DataFrame

In [19]:
# Display data types of columns in 2020 sales DataFrame
print("2020 Sales Data Types:")
print(df_2020.dtypes)

2020 Sales Data Types:
retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [21]:
# Check the 2021 sales data types.
print("2021 Sales Data Types:")
print(df_2021.dtypes)

2021 Sales Data Types:
retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [25]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_df = pd.concat([df_2020, df_2021], ignore_index=True)

combined_df.reset_index(drop=True, inplace=True)

print("Combined DataFrame:")
print(combined_df.head())

Combined DataFrame:
      retailer  retailer_id invoice_date     region         state  \
0  Foot Locker      1185732       1/1/20  Northeast      New York
1  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3  Foot Locker      1185732       1/1/20  Northeast      New York
4  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania

           city                product  price_per_unit  units_sold  \
0      New York  Men's Street Footwear              50        1200
1  Philadelphia        Women's Apparel              68          83
2  Philadelphia        Women's Apparel              75         275
3      New York  Men's Street Footwear              34         384
4  Philadelphia        Women's Apparel              53          83

   total_sales  operating_profit sales_method
0       600000         300000.00     In-store
1         5644           2426.92       Online
2       206250          61875.00       Outlet
3        13056           6789.12       Outlet
4         4399           1407.68       Outlet

In [27]:
# Check if any values are null.
null_counts = combined_df.isnull().sum()

print("Columns with Null Values:")
print(null_counts[null_counts > 0])

Columns with Null Values:
Series([], dtype: int64)

In [29]:
# Check the data type of each column
print("Data Types of Columns in Combined DataFrame:")
print(combined_df.dtypes)

Data Types of Columns in Combined DataFrame:
retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [31]:
# Convert the "invoice_date" to a datetime datatype
combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

print("Converted DataFrame:")
print(combined_df.head())

Converted DataFrame:
      retailer  retailer_id invoice_date     region         state  \
0  Foot Locker      1185732   2020-01-01  Northeast      New York
1  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
2  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
3  Foot Locker      1185732   2020-01-01  Northeast      New York
4  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania

           city                product  price_per_unit  units_sold  \
0      New York  Men's Street Footwear              50        1200
1  Philadelphia        Women's Apparel              68          83
2  Philadelphia        Women's Apparel              75         275
3      New York  Men's Street Footwear              34         384
4  Philadelphia        Women's Apparel              53          83

   total_sales  operating_profit sales_method
0       600000         300000.00     In-store
1         5644           2426.92       Online
2       206250          61875.00       Outlet
3        13056           6789.12       Outlet
4         4399           1407.68       Outlet

/var/folders/9t/_vjv4_ms7kv9t_1rd71n1m5r0000gn/T/ipykernel_7977/2060367491.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

In [33]:
# Confirm that the "invoice_date" data type has been changed.
combined_df['invoice_date'] = pd.to_datetime(combined_df['invoice_date'])

print("Confirmed Data Types:")
print(combined_df.dtypes)

Confirmed Data Types:
retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [35]:
# Group by region, state, and city, sum total products sold
products_sold = combined_df.groupby(['region', 'state', 'city']).size().reset_index(name='Total_Products_Sold')

# Sort in descending order and display top 5 results
top_products_sold = products_sold.sort_values(by='Total_Products_Sold', ascending=False).head()

# Display the top 5 results
print("Top 5 Regions, States, and Cities by Total Products Sold:")
print(top_products_sold)

Top 5 Regions, States, and Cities by Total Products Sold:
       region      state           city  Total_Products_Sold
27      South   Arkansas    Little Rock                  216
40  Southeast   Virginia       Richmond                  216
32      South      Texas         Dallas                  216
31      South  Tennessee      Knoxville                  216
30      South   Oklahoma  Oklahoma City                  216

#### Using `pivot_table`

In [37]:
# Group by region, state, and city, sum total products sold
products_sold = combined_df.groupby(['region', 'state', 'city']).size().reset_index(name='Total_Products_Sold')

# Sort in descending order and display top 5 results
top_products_sold = products_sold.sort_values(by='Total_Products_Sold', ascending=False).head()

# Display the top 5 results
print("Top 5 Regions, States, and Cities by Total Products Sold:")
print(top_products_sold)

Top 5 Regions, States, and Cities by Total Products Sold:
       region      state           city  Total_Products_Sold
27      South   Arkansas    Little Rock                  216
40  Southeast   Virginia       Richmond                  216
32      South      Texas         Dallas                  216
31      South  Tennessee      Knoxville                  216
30      South   Oklahoma  Oklahoma City                  216

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [14]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [39]:
# Group by region, state, and city, sum total sales
total_sales = combined_df.groupby(['region', 'state', 'city'])['total_sales'].sum().reset_index(name='Total Sales')

# Sort in descending order and display top 5 results
top_total_sales = total_sales.sort_values(by='Total Sales', ascending=False).head()

# Display the top 5 results
print("Top 5 Regions, States, and Cities by Total Sales:")
print(top_total_sales)

Top 5 Regions, States, and Cities by Total Sales:
       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [16]:
# Group by region, state, and city, sum total sales
total_sales = combined_df.groupby(['region', 'state', 'city'])['total_sales'].sum().reset_index()

# Optionally rename the column
total_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Sort in descending order and display top 5 results
top_total_sales = total_sales.sort_values(by='Total Sales', ascending=False).head()

# Display the top 5 results
print("Top 5 Regions, States, and Cities by Total Sales:")
print(top_total_sales)

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [69]:
# Group by retailer, region, state, and city, sum total sales
total_sales = combined_df.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum().reset_index()

# Optionally rename the column
total_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Sort in descending order and display top 5 results
top_total_sales = total_sales.sort_values(by='Total Sales', ascending=False).head()

# Display the top 5 results
print("Top 5 Retailers, Regions, States, and Cities by Total Sales:")
top_total_sales

Top 5 Retailers, Regions, States, and Cities by Total Sales:

        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [67]:
# Filter for women's athletic footwear sales
print("Column Names:")
print(combined_df.columns)

women_athletic_sales = combined_df[combined_df['product'] == 'Women\'s Athletic Footwear']

print("\nWomen's Athletic Footwear Sales Data:")
women_athletic_sales.head()

Column Names:
Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

Women's Athletic Footwear Sales Data:

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [65]:
# Filter for women's athletic footwear sales
women_athletic_sales = combined_df[combined_df['product'] == "Women's Athletic Footwear"]

# Group by retailer, region, state, and city, sum women's athletic footwear units sold
women_athletic_footwear_units_sold = women_athletic_sales.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()

# Rename the column to "Womens_Footwear_Units_Sold"
women_athletic_footwear_units_sold.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)

# Sort in descending order and display top 5 results
top_womens_footwear_sales = women_athletic_footwear_units_sold.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head()

# Display the top 5 results
print("Top 5 Retailers, Regions, States, and Cities by Women's Athletic Footwear Units Sold:")
top_womens_footwear_sales

Top 5 Retailers, Regions, States, and Cities by Women's Athletic Footwear Units Sold:

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [63]:
# Filter for women's athletic footwear sales
women_athletic_sales = combined_df[combined_df['product'] == "Women's Athletic Footwear"]

# Group by retailer, region, state, and city, sum women's athletic footwear units sold
women_athletic_footwear_units_sold = women_athletic_sales.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()

# Rename the column to "Womens_Footwear_Units_Sold"
women_athletic_footwear_units_sold.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)

# Sort in descending order and display top 5 results
top_womens_footwear_sales = women_athletic_footwear_units_sold.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head()

# Display the top 5 results
print("Top 5 Retailers, Regions, States, and Cities by Women's Athletic Footwear Units Sold:")
top_womens_footwear_sales

Top 5 Retailers, Regions, States, and Cities by Women's Athletic Footwear Units Sold:

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [5]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_table = combined_df.pivot_table(index='invoice_date', values='total_sales')


# Optional: Rename the "total_sales" column to "Total Sales"
pivot_table = pivot_table.rename(columns={'total_sales': 'Total Sales'})

# Show the table.
pivot_table

NameError: name 'combined_df' is not defined

In [1]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales = pivot_table.resample('D').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
daily_sales_sorted = daily_sales.sort_values(by='total_sales', ascending=False)
daily_sales_sorted

NameError: name 'pivot_table' is not defined

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [3]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales = pivot_table.resample('W').sum()


# Sort the resampled pivot table in descending order on "Total Sales".
weekly_sales_sorted = weekly_sales.sort_values(by='total_sales', ascending=False)
weekly_sales_sorted

NameError: name 'pivot_table' is not defined